import 'package:firebase_core/firebase_core.dart';
import 'package:cloud_firestore/cloud_firestore.dart';

Future<void> main() async {
  await Firebase.initializeApp();
  FirebaseFirestore firestore = FirebaseFirestore.instance;

  // قائمة بالدول مع البيانات الخاصة بكل دولة
  Map<String, Map<String, List<Map<String, dynamic>>>> countriesData = {
    "فلسطين": {
     "الأيتام": [
      {
        "name": "برنامج نور",
        "short_description": "إحداث تأثير في المكان المناسب من خلال التبرع، تساعدنا على الاستجابة لأهم وأكبر القضايا الملحة في فلسطين، بهدف أن يواصل شعبها الصمود والازدهار. نواصل تحديد احتياجات وأولويات شعبنا لخلق أساليب فعّالة وقوية لاستخدام التبرعات التي نتلقاها من أشخاص مثلك. آلاف الأطفال في غزة يعانون من الألم والصدمة لفقدان أحد والديهم. الدفء والرعاية من أحبائهم تلاشى في غضون لحظات لا يجب أن يواجه أي طفل هذه المعاناة بمفرده. من مسؤوليتنا واختيارنا أن نقف إلى جانبهم الآن. ندعوكم للمساهمة معنا في تقديم الإغاثة الفورية وبناء نظام دعم مستدام لـ 20,000 يتيمة",
 "full_description": "مؤسسة أهلية مستقلة مسجلة كفرع في فلسطين تأسست عام 1983 بمبادرة مجموعة من الشخصيات الاقتصادية والفكرية الفلسطينية والعربية بهدف تمكين الإنسان الفلسطيني اجتماعياً واقتصادياً، في فلسطين وفي مخيمات الشتات الفلسطينية في لبنان. تنفذ 'التعاون' مشاريعها التنموية والإغاثية ضمن أربعة برامج رئيسية: التعليم، الثقافة، التنمية المجتمعية بما يشمل التمكين الاقتصادي ودعم الأيتام، وبرنامج القدس لإعمار البلدات القديمة.\n\n"
    "آلاف الأطفال في غزة يعانون من الألم والصدمة لفقدان أحد والديهم.\n"
    "الدفء والرعاية من أحبائهم تلاشى في غضون لحظات لا يجب أن يواجه أي طفل هذه المعاناة بمفرده. من مسؤوليتنا واختيارنا أن نقف إلى جانبهم الآن.\n"
    "ندعوكم للمساهمة معنا في تقديم الإغاثة الفورية وبناء نظام دعم مستدام لـ 20,000 يتيمة.\n"
    "قم بإحداث تأثير مباشر.\n"
    "اكفل يتيماً اليوم.\n"
    "أزمة إنسانية كبرى تتطلب دعماً غير مسبوق. هذا ما نفعله لضمان وصول التبرعات إلى كل يتيم.بالشراكة مع مجموعة بنك فلسطين، أطلقنا برنامج نور لرعاية 20,000 طفل تيتموا نتيجة الحرب على غزة. تسعى لجمع 377 مليون دولار لتقديم خدمات متكاملة تضمن للأيتام العيش بكرامة وتمكنهم من أن يصبحوا أفراداً فاعلين في مجتمعاتهم وبناء مستقبل أفضل.\n\n"
    "ستواجه التحديات على عدة أصعدة، بدءاً من تلبية الاحتياجات الفورية الناتجة عن القصف المستمر والاعتداءات، وصولاً إلى إنشاء نظام دعم مستدام يعتمد عليه الأيتام حتى بلوغهم سن 18 عاماً.\n\n"
    "تعاوننا مع شركاتنا في غزة سيساهم في تنفيذ مختلف التدخلات وضمان الوصول المباشر إلى الأيتام وعائلاتهم. بالإضافة إلى تنفيذ الأنشطة في كل موقع في الوقت نفسه سيشارك معنا فريق من الخبراء الخارجيين لتقييم احتياجات البرنامج وتأثيره وتقدمه.\n\n"
    "هذه أكبر حملة لنا لرعاية الأيتام حتى الآن. ونحن نعتمد على كل مساهمة.\n\n"
    "سيتم تسجيل كل طفل في برنامجنا حتى بلوغه 18 عاماً.\n\n"
    "مجالات التدخل:\n"
    "الاحتياجات لكل يتيم في السنة (دولار أمريكي):\n"
    "• الغذاء والملابس: قسائم وجبات دورية وطردان من الملابس سنوياً\n"
    "• الرعاية الصحية: الفحص والعلاج الطبي، إعادة تأهيل الأيتام ذوي الإعاقة، وتوفير الأجهزة المساعدة\n"
    "• التعليم والتدريب المهني: الرسوم الدراسية، الزي المدرسي، الحقيبة، التعليم المساند، الأنشطة اللامنهجية، رعاية المواهب، والتعليم المهني\n"
    "• الحماية والدعم النفسي: جلسات فردية وجماعية، بالإضافة إلى الأنشطة الترفيهية العلاجية\n"
    "• الرعاية الاجتماعية: الرعاية في دور الأيتام أو الأسر الحاضنة.",

        "contact": "+970 2 241 5130",
        "website": "https://www.taawon.org/ar/noor",
        "social_media":"https://www.facebook.com/TaawonPalestine/about_details",
        "email": "info@taawon.org"
      },
      {
        "name": "جمعية دار اليتيم الفلسطيني",
        "short_description": "جمعية دار اليتيم الفلسطيني جمعية خيرية ناشئة تم انشاؤها عام 2006م بهدف تقديم الخدمات الانسانية والاجتماعية والتعليمية والصحية والتنموية لفئة الأيتام والفقراء والمحتاجين في قطاع غزة.\n"
    "وذلك من خلال برامج وأنشطة تنفذها الجمعية مثل الكفالات الشهرية والمساعدات الموسمية التي تقدم للأسر المحتاجة.\n"
    "إلى جانب ما يقدم من مساعدات عبر المشاريع الموسمية كالحقيبة المدرسية والأضاحي ومشاريع رمضان والاغاثات الطارئة\n"
    "وغيرها من المشاريع الاجتماعية والتعليمية والصحية والتنموية التي من شأنها التخفيف من حدة معاناة هذه الفئات من شعبنا الفلسطيني.",
     "full_description": "جمعية دار اليتيم الفلسطيني جمعية خيرية تم إنشاؤها عام 2006م بهدف تقديم الخدمات لفئة الأيتام والأسر المحتاجة في قطاع غزة وذلك من خلال برامج وأنشطة تنفذها الجمعية مثل الكفالات الشهرية التي تقدم للأيتام والأسر المحتاجة.\n"
    "إلى جانب ما يقدم من مساعدات عبر المشاريع الموسمية كالحقيبة المدرسية والأضاحي ومشاريع رمضان والاغاثات الطارئة وغيرها من المشاريع التي من شأنها التخفيف من حدة معاناة هذه الفئات من شعبنا الفلسطيني.\n\n"
    "أهداف الجمعية:\n"
    "1. كفالة الأيتام والمتضررين من فقدان من يعولهم.\n"
    "2. إنشاء المدارس للأيتام.\n"
    "3. تقديم الرعاية الصحية والاجتماعية والتربوية للأيتام.\n"
    "4. تقديم المساعدات للأيتام من خلال مشاريع رمضان والأضاحي والحقيبة المدرسية.\n"
    "5. إقامة مشاريع تنموية يعود ريعها للأيتام.\n"
    "6. إعادة التوافق النفسي للأطفال الأيتام.\n"
    "7. التعاون مع الجهات الرسمية والمؤسسات الخيرية المحلية والدولية من أجل تحقيق أهداف الجمعية.",
     "contact": "+970 593 115 554",
        "website": "Palestinian Orphan Home جمعية دار اليتيم الفلسطيني",
        "email": "darelyateem.org@gmail.com"
      },
      {
        "name": "Penny Appeal",
        "short_description": "تأسست Penny Appeal في عام 2009 لتوفير الإغاثة من الفقر في جميع أنحاء آسيا والشرق الأوسط وأفريقيا.\n"
    "وذلك من خلال تقديم حلول المياه، وتنظيم التغذية الجماعية، ودعم رعاية الأيتام، وتقديم المساعدات الغذائية والطبية في حالات الطوارئ.",
        "full_description":"حملة أحبوا فلسطين (Love Palestine) مستمرة منذ سنوات لدعم الشعب الفلسطيني من خلال توفير الرعاية الصحية، والغذاء، والمساعدات الحيوية. \n\n"
    "في أكتوبر 2023، شهدت فلسطين قصفًا عنيفًا أدى إلى مقتل وإصابة الآلاف، مع استمرار ارتفاع أعداد الضحايا. \n"
    "تعاني المستشفيات من نقص حاد في الوقود، الكهرباء، والمياه، مما يهدد بانهيار النظام الصحي. \n\n"
    "من خلال تبرع بسيط، يمكنك المساهمة في توفير الوجبات الساخنة، حزم الطعام، المياه النظيفة، والإمدادات الطبية العاجلة. \n"
    "مستشفى المقاصد، الذي يعتمد عليه الفلسطينيون، يواجه نقصًا حادًا في الموارد مع تزايد عدد المصابين المحتاجين للرعاية العاجلة. \n\n"
    "يمكنك المساعدة من خلال تبرع لمرة واحدة أو دعم شهري. \n"
    "نطلب منكم الدعاء لأهل فلسطين. \n"
    "يا ﷲ الرحمن الرحيم، أنزل رحمتك على أهل فلسطين.",
    "contact": "+44 300 011 1111", 
        "website": "Donate to Love Palestine | Palestine Charity UK | Penny Appeal",
        "social_media": "PennyAppeal"
      },
      {
        "name": "برنامج رعاية أيتام غزة ",
        "short_description":  "جمعية الرحمة الدولية هي إحدى المؤسسات الخيرية الكويتية العاملة في المجالات الخيرية والإنسانية، "
      "وقد بدأت منذ أكثر من 38 عامًا، حيث تم تأسيسها عام 1982 كإحدى اللجان الخيرية ثم تم نشرها من قبل وزارة الشؤون الاجتماعية "
      "بموجب القرار الوزاري رقم 100 / أ 2018 م، لتقديم خدماتها للمحتاجين داخل وخارج دولة الكويت، من خلال مشاريع تنموية وتعليمية وصحية "
      "تهدف إلى النهوض بحياة الإنسان بالإضافة إلى الأيتام والأسر الفقيرة والمتواضعة وتقديم الإغاثة العاجلة للمحتاجين. "
      "جميع الأيتام والطلاب والأسر المحتاجة المتواضعة والمحتاجين من اللاجئين والمحتاجين والفقراء والمرضى والمنكوبين "
      "والمتضررين من الحروب والكوارث الطبيعية.",
        "full_description":
      "أبرز ما يميز مؤسسة الرحمة الدولية هو حصولها على شهادة ISO 9001: 2015 وكونها أول مؤسسة خيرية في الشفافية على مستوى الوطن العربي حسب تصنيف مجلة فوربس، "
      "وحصولها على 16 جائزة وطنية ودولية آخرها جائزة سمو سالم. كما تم تكريم جمعية الرحمة الدولية من قبل الرئيس الجيبوتي ورئيس الوزراء الكمبودي والمؤسسات الدولية نظرًا لجهودها التنموية. "
      "وللجمعية شراكات واتفاقيات تعاون مع عدد من المؤسسات الإنسانية والخيرية داخل وخارج الكويت، منها بيت الزكاة بالكويت، مؤسسة الأوقاف الكويتية، الهيئة الخيرية الإسلامية العالمية، "
      "المفوض السامي للأمم المتحدة لشؤون اللاجئين، اللجنة الدولية للصليب الأحمر، البنك الإسلامي للتنمية، مؤسسة الإغاثة الإنسانية IHH، والمنظمة التركية ومركز الملك سلمان للإغاثة والأعمال الإنسانية.\n\n"
      "ومن أهم إنجازات مؤسسة الرحمة الدولية:\n"
      "١- 145,395 فردًا بين أيتام وطلاب وأسر محتاجة يتلقون رعاية ودعمًا.\n"
      "٢- إنشاء 30 مجمعًا تنموياً للأيتام.\n"
      "٣- بناء 456 مؤسسة تعليمية.\n"
      "٤- تأسيس 397 منشأة طبية.\n"
      "٥- تنفيذ 12 مشروعًا تنمويًا صغيرًا.\n"
      "٦- تنفيذ 682 مشروعًا للآبار والمياه.\n"
      "٧- 30,103 مستفيد من المشاريع الموسمية مثل إفطار الصائمين والأضاحي.\n"
      "٨- بناء 69,000,000 مسكن للعائلات المحتاجة.\n"
      "٩- تقديم مساعدات لـ 6,060 مستفيد.\n"
      "١٠- تشييد 207,550 مسجدًا.",
           "contact": "+965 1888808",
           "location"  :"المدينة مدينة الكويت العنوان محافظة حولي قطعة 5 شارع المعتصم موازي لشارع القاهرة الدولة الكويت",
        "website": "https://www.healpalestine.org",
        "social_media": "https://www.facebook.com/HealPalestine"
      },
    ],
    "التعليم": [
      {
        "name": "شفاء فلسطين",
        "short_description":"إن مبادرة \"شفاء فلسطين\" مدفوعة بالإيمان بأن كل شاب فلسطيني يستحق فرصة لمستقبل أكثر إشراقًا. "
  "ومن خلال عملنا في مجالات الصحة والتعليم والمساعدات وتنمية المهارات القيادية، "
  "فإننا نسعى جاهدين لجعل هذه الرؤية حقيقة واقعة للشباب الفلسطيني.",
        "full_description": "تعتبر Heal Palestine منظمة غير ربحية معفاة من الضرائب مسجلة في الولايات المتحدة بموجب المادة 501(c)(3) "
  "تأسست في الأول من يناير 2024 استجابة للدمار الهائل والخسائر في غزة. باعتبارها منظمة غير سياسية، "
  "تلتزم HEAL بمساعدة الأطفال الفلسطينيين في إعادة بناء حياتهم من خلال نهج شامل على مستوى القاعدة.\n\n"
  "نهج شامل من خلال ركائزنا الأربعة\n"
  "من خلال ركائزنا الأساسية - الصحة والتعليم والمساعدات والقيادة - لا تهدف HEAL Palestine إلى تلبية "
  "الاحتياجات الأساسية للأطفال الفلسطينيين فحسب، بل وتمكينهم من تحقيق إمكاناتهم الكاملة.\n\n"
  "نهج شعبي\n"
  "تعتبر HEAL Palestine منظمة شعبية مدعومة بالدعم السخي من المانحين والمتطوعين المجتمعيين المخلصين، "
  "بما في ذلك المهنيين الطبيين، في جميع أنحاء الولايات المتحدة وحول العالم، مع مساهمة خاصة من الشتات الفلسطيني الموهوب.\n\n"
  "تمكين الشباب والعائلات الفلسطينية\n"
  "تمكن مشاريع وبرامج HEAL Palestine في غزة ومصر الفلسطينيين من دعم مجتمعاتهم ورفع مستواها.\n\n"
  "استعادة الأمل والفرصة\n"
  "تتطلع منظمة HEAL Palestine إلى إنشاء دولة فلسطين حيث يتمتع جميع أطفالها بالقدرة على الوصول إلى الرعاية "
  "الصحية والتعليم الجيد؛ وتلبية احتياجاتهم الإنسانية الأساسية؛ والحصول على الأدوات والفرص اللازمة ليكونوا "
  "قادة ومحفزين للتغيير الإيجابي في بلدهم، والذي لن يضطر بعد الآن إلى الاعتماد على الآخرين لتحقيق النجاح.",
        "website": " About Us - HEAL Palestine",
        "social_media": "HEAL Palestine | Kent OH "
      },
      {
        "name": "اليونيسيف - UNICEF",
        "short_description":  "يساعد نداء العمل الإنساني للأطفال التابع لصندوق الأمم المتحدة لتعليم الأطفال (اليونيسف) في دعم عمل الوكالة "
  "حيث أنها توفر للأطفال المتضررين من النزاعات والكوارث إمكانية الحصول على خدمات المياه والصرف الصحي "
  "والتغذية والتعليم والصحة والحماية.",
        "full_description":  "نداء دولة فلسطين\n"
  "العمل الإنساني من أجل الأطفال\n\n"
  "يساعد نداء العمل الإنساني من أجل الأطفال التابع لليونيسف في دعم عمل الوكالة حيث يوفر للأطفال المتضررين "
  "من الصراع والكوارث إمكانية الوصول إلى المياه والصرف الصحي والتغذية والتعليم والصحة وخدمات الحماية. "
  "العودة إلى صفحة النداء الرئيسية.\n\n"
  "لمحة عن دولة فلسطين\n"
  "تحميل النداء الكامل تقارير حالة دولة فلسطين تبرع الآن\n\n"
  "أبرز ما جاء في النداء\n"
  "في دولة فلسطين، أدى الصراع في قطاع غزة والعنف المتزايد في الضفة الغربية، بما في ذلك القدس الشرقية، إلى "
  "عواقب إنسانية وخيمة: الوفيات والنزوح الجماعي وانفصال الأطفال. يحتاج ما لا يقل عن 3.3 مليون شخص إلى المساعدة.\n\n"
  "في قطاع غزة، أدى الضرر الذي لحق بالبنية التحتية والوصول الإنساني المحدود إلى خلق احتياجات حرجة لخدمات المياه "
  "والصرف الصحي والرعاية الصحية، مع تفشي الأمراض المنقولة بالمياه وشلل الأطفال مما يهدد الصحة العامة. "
  "ويتفاقم انعدام الأمن الغذائي ويعرض الآن 322000 طفل لخطر سوء التغذية. ويواجه الآلاف من الأطفال أيضًا "
  "تحديات الصحة العقلية، وهناك 660.000 طفل خارج المدرسة. في الضفة الغربية، يؤثر العنف والصعوبات الاقتصادية "
  "على أكثر من 830 ألف شخص يحتاجون إلى الرعاية الصحية ودعم المياه والصرف الصحي؛ ويحتاج 133 ألف طفل إلى دعم التعليم.\n\n"
  "تقدم اليونيسف الدعم المنقذ للحياة في مجال المياه والصرف الصحي والصحة والتغذية والتعليم وحماية الطفل "
  "والحماية الاجتماعية والتحويلات النقدية مع دعم استعادة النظام وتعزيزه.\n\n"
  "تناشد اليونيسف توفير 716.5 مليون دولار أمريكي في عام 2025 لتزويد الأطفال بالخدمات الأساسية ومساعدتهم "
  "على الازدهار على الرغم من الصراع المستمر.\n\n"
  "تقيس امرأة الجزء العلوي من ذراع طفل\n"
  "SoP/2024-اليونيسف\n\n"
  "في عيادة طب الأطفال التي تدعمها اليونيسف في دير البلح، قطاع غزة، يقوم عامل صحي بفحص سوء التغذية "
  "باستخدام شريط محيط منتصف الذراع العلوي. كما يتلقى الأطفال بسكويت عالي الطاقة.\n\n"
  "الأهداف الرئيسية المخطط لها\n"
  "أيقونة الصحة\n"
  "893,333 طفل وامرأة يحصلون على الرعاية الصحية الأولية\n"
  "أيقونة حماية الطفل\n"
  "349,788 طفل/مقدم رعاية يحصلون على خدمات الصحة العقلية والدعم النفسي الاجتماعي المجتمعي\n"
  "أيقونة المياه والصرف الصحي\n"
  "2.1 مليون شخص يحصلون على كمية ونوعية كافية من المياه\n"
  "أيقونة الإدماج الاجتماعي\n"
  "765,000 شخص يحصلون على تحويلات نقدية إنسانية من خلال استجابة اليونيسف\n\n"
  "متطلبات التمويل لعام 2025",
        "website": "https://www.unicef.org/sop/",
        "social_media": "https://www.facebook.com/unicefpalestine"
      },
      
      {
    "name": "مؤسسة إحياء الدولة",
    "short_description": "تعتبر مؤسسة إحياء منظمة غير ربحية مقرها الرسمي في اسطنبول - تركيا، "
  "تأسست رسمياً تحت رقم قيد (133-234-34)\n\n"
  "هي مؤسسة خيرية تعنى وتهتم بتراث الأمة وتاريخها الحضاري والإنساني، "
  "وتقديم كافة الأعمال والخدمات التي تساهم في إحيائه والحفاظ عليه واستعادته بكافة الوسائل والمتطلبات.",
    "full_description": "هي مؤسسة تركية غير ربحية مقرها الرسمي في اسطنبول - تركيا. "
  "تأسست رسمياً تحت رقم قيد (34-234-133) كجمعية خيرية.\n\n"
  "تعُنى وتهتم بتراث الأمة الإسلامي والإنساني، وبتقديم كافة الأعمال والخدمات "
  "التي تساهم في إحيائه والحفاظ عليه واستعادته بكافة الوسائل والمتطلبات.\n\n"
  "تسعى المؤسسة جاهدة إلى توحيد الجهود الإنسانية من أجل تنمية وتطوير الإنسان في كل مكان "
  "بغض النظر عن العرق، اللون، الجنس أو المعتقد. قيمنا:\n"
  "- الدقة\n"
  "- الابتكار\n"
  "- الاحترافية\n"
  "- العدالة\n\n"
  "حيث نعمل على جملة أهداف نسعى لتحقيقها:\n"
  "- استعادة الدور السابق للأمة الإسلامية اتجاه القدس والمسجد الأقصى الشريف\n"
  "- استحداث دور للأمة الإسلامية\n"
  "- ترميم وصيانة الإرث التاريخي العريق ورعايته والحفاظ عليه\n"
  "- إغاثة وتلبية نداءات الملهوفين الأشد احتياجاً\n"
  "- الاهتمام بالأجيال الناشئة وزيادة وعيها بالتراث والتاريخ الحضاري والإنساني للأمة\n"
  "- بناء شراكات مع المنظمات والمؤسسات ذات الأهداف المشتركة.",
   "contact": "الموقع: حملة التعليم في مستشفى\nالعنوان: مؤسسة إحياء الدولة | Fatih"
},

      {
        "name": "مؤسسة التعليم فوق الجميع",
        "short_description":
  "تهدف مؤسسة التعليم فوق الجميع إلى بناء حركة عالمية تساهم في التنمية البشرية والاجتماعية والاقتصادية "
  "من خلال التعليم الجيد وغيره من مبادرات وبرامج الرفاه. تركز المؤسسة بشكل خاص على المناطق الفقيرة "
  "ومناطق النزاعات والكوارث وتلبي حاجات الأطفال والنساء وتساعدهم على أن يكونوا أعضاء نشيطين في مجتمعاتهم. "
  "ومن خلال تلبية الطلب على التعليم فإننا نزودهم بالأدوات التي تساعد على دعم التنمية المستدامة وخلق بيئة "
  "من السلم والأمن والعدالة والازدهار.",
    "contact": " +974 4454 2288 ", 
        "website": "partnerships@eaa.org.qa",
      },
    ],
    "المساعدات الطبية": [
      
      {
        "name": "مؤسسة أنير",
        "short_description":"منذ عام 1968 ، ساعدت منظمة المعونة الأمريكية للاجئين في الشرق الأدنى (ANERA) النازحين واللاجئين وغيرهم ممن تضرروا من النزاعات في فلسطين ولبنان والأردن على العيش بكرامة وهدف.",
        "full_description":
  "تأسست أنيرا في عام 1968 للاستجابة لاحتياجات اللاجئين الفلسطينيين. "
  "ومنذ ذلك الحين، نعمل على الأرض مع شركاء في الضفة الغربية وغزة لتقديم برامج مستدامة وطويلة الأمد في "
  "مجال الصحة والتعليم والتنمية الاقتصادية للمجتمعات الفلسطينية الضعيفة.\n\n"
  "في جميع أنحاء فلسطين، يعمل الاحتلال والحصار على الحد من التنمية الاقتصادية والتجارة الفلسطينية. "
  "بدعمك، تقدم أنيرا الموارد لدعم المزارعين الصغار، وتحسين الوصول إلى التعليم، ودعم سبل العيش، "
  "وتعزيز خدمات المياه والصرف الصحي.\n\n"
  "كيف نساعد فلسطين\n"
  "بدعمك، تساعد أنيرا المجتمعات الفلسطينية في الوصول إلى الفرص التعليمية والمياه النظيفة والتوظيف "
  "والبنية الأساسية المجتمعية. ستساعد مساهمتك أنيرا على العمل بشكل مباشر مع المجتمعات الفلسطينية لإحداث "
  "تغيير طويل الأمد وهادف. تعرف على المزيد حول استخدام هديتك من خلال زيارة صفحة الأسئلة الشائعة لدينا، "
  "ثم تبرع اليوم لتحسين الحياة في فلسطين.",

        "contact": "9700-266-202 1+ ",
        "website": "Anera",
        "email": ".Help hope find a way. Donate now"
      },
      {
        "name": "جمعية الهلال الأحمر الفلسطيني",
        "short_description": "جمعية الهلال الأحمر الفلسطيني، التي تأسست رسميًا في كانون الأول/ديسمبر 1968، هي منظمة إنسانية وطنية. منذ إنشائها، تعمل على توفير الرعاية الصحية والرفاهية للشعب الفلسطيني وغيرهم من المحتاجين في الأراضي الفلسطينية المحتلة والشتات.",
        "full_description":
  "جمعية الهلال الأحمر الفلسطيني، هي جمعية وطنية ذات شخصية إعتبارية مستقلة، معترف بها رسميا، "
  "وهي أحد مكونات الحركة الدولية للصليب الأحمر والهلال الأحمر، تمارس نشاطها في الأرض الفلسطينية المحتلة "
  "وفي مناطق تجمعات الشعب الفلسطيني، إستنادا إلى اتفاقيات جنيف، وإلى مبادئ الحركة الدولية للصليب الأحمر "
  "والهلال الأحمر السبعة: الإنسانية، عدم التحيز، الحياد، الإستقلال، التطوع، الوحدة، والعالمية.\n\n"
  "ويرجع تأسيس أول هيئة لجمعية الهلال الأحمر في فلسطين إلى العام 1910 في مدينة القدس. وتوالى إنتشار الهلال "
  "الأحمر في المدن الفلسطينية الاخرى مثل حيفا ويافا، ونابلس والخليل وغيرها، والتي واكبت المعاناة الانسانية "
  "للشعب الفلسطيني منذ النكبة في العام 1948 لغاية يومنا هذا.\n\n"
  "تأسس الهلال الأحمر الفلسطيني، رسميا، كجمعية وطنية بتاريخ 1968/12/26، وبدأت الجمعية بتقديم خدماتها الصحية "
  "عبر عيادة صغيرة في مخيم (شنلر) للاجئين الفلسطينيين في الأردن. واكتسبت شخصيتها الإعتبارية، بموجب قرار من "
  "المجلس الوطني الفلسطيني في دورته السادسة التي عقدت في القاهرة بتاريخ 1/1969/9، لتصبح بعد ذلك التاريخ "
  "مؤسسة صحية واجتماعية مهمة من مؤسسات منظمة التحرير الفلسطينية، ضمت عشرات الآلاف من الكوادر والأعضاء والمتطوعين "
  "الفلسطينيين والعرب والأجانب.\n\n"
  "وتم التأكيد على هذا الدور المهم للجمعية ومكانتها القانونية والاعتبارية بموجب المرسوم الرئاسي رقم (46) لسنة 1977، "
  "والمرسوم الرئاسي رقم (12) لسنة 2006. ونظرا للدور الإنساني الذي لعبته الجمعية على صعيد تقديم الخدمات الصحية "
  "والاجتماعية للشعب الفلسطيني في الوطن والشتات، ولكل محتاج، ونظرا لسمعتها وحضورها المتميز في الفعاليات الإنسانية "
  "الفلسطينية والعربية والدولية حصلت الجمعية على العضوية الكاملة (العضو رقم 184) في الاتحاد الدولي لجمعيات "
  "الصليب الأحمر والهلال الأحمر بتاريخ 22/2006/6، بناء على قرار من المؤتمر الدولي التاسع والعشرين للحركة الدولية "
  "للصليب الأحمر والهلال الأحمر.\n\n"
  "تتمثل رسالة جمعية الهلال الاحمر الفلسطيني في توفير الخدمات الإنسانية و الصحية والاجتماعية والإغاثية للشعب الفلسطيني، "
  "حيثما تواجدت الحاجة، وأينما كان. ولدرء المعاناة الإنسانية، تهدف الجمعية الى تعزيز جاهزيتها لمواجهة حالات الطوارئ "
  "المختلفة، كالكوارث الطبيعية والمعاناة التي يسببها الإحتلال، والاستمرار في تقديم وتطوير خدمات وبرامج الجمعية الصحية "
  "والاجتماعية في الوطن والشتات وتحسين نوعيتها، وتفعيل برامج الضغط والمناصرة والدبلوماسية الإنسانية، وتعزيز وتنويع شراكات "
  "الجمعية بما يمكنها من استقطاب الدعم لتعزيز دورها الإنساني، والاستمرار في عملية البناء المؤسسي، وتعزيز قدرات الجمعية "
  "وفروعها من أجل النهوض بواجباتها ومواجهة التحديات التي تواجهها.",
        "contact": "+970 2 297 8520",
        "website": "https://www.palestinercs.org/ar/donation",
        "email": "info@palestinercs.org",
          "social_media": "Ramallah | الهلال الاحمر الفلسطيني Palestine Red Crescent society",
      },

    {
        "name": "منظمة اطباء بلا حدود ",
        "short_description":
  "منظمة طبية إنسانية دولية مستقلة تقدم المساعدة الطبية للأشخاص المتضررين من النزاعات أو الأوبئة أو الكوارث أو الاستبعاد من الرعاية الصحية، وتسترشد أعمالها بأخلاقيات الطب ومبادئ الحياد والاستقلال والحياد.",
   "full_description":
  "نحن نقدم المساعدة الطبية والنفسية للأشخاص المتضررين من الصراع الدائر في الضفة الغربية وغزة.\n\n"
  "في غزة، يعاني نظام الرعاية الصحية المحلي من ضغوط شديدة ونقص التمويل وتأثر بشدة بالحصار الذي دام 16 عامًا. "
  "نحن نقدم المساعدة للأشخاص المتضررين من الحروق والصدمات من خلال نهج متعدد التخصصات، والذي يمكن أن يشمل "
  "الرعاية الجراحية والعلاج الطبيعي والعلاج المهني والتثقيف الصحي والدعم النفسي والاجتماعي.\n\n"
  "في الضفة الغربية، لا يزال الاحتلال والعنف والبطالة والفقر لها تأثير عميق على الصحة العقلية للفلسطينيين. "
  "تقدم فرقنا الدعم النفسي في الخليل ونابلس وقلقيلية.\n\n"
  "نحن نقدم خدمات الرعاية الصحية في منطقة H2، في مدينة الخليل، حيث تخضع حركة السكان الفلسطينيين لقيود تعيق "
  "بشدة وصولهم إلى الرعاية الصحية. كما بدأنا في تشغيل عيادات متنقلة لتلبية الاحتياجات الصحية للمجتمعات في "
  "مسافر يطا، الذين يواجهون هدم المنازل وزيادة خطر النقل القسري.",
  
        "website": "Palestine | MSF medical and humanitarian aid",
         "social_media":" Without Doctors borders"
      },  
      {
    "name": "المساعدات الطبية للفلسطينيين",
    "short_description": "تعمل MAP بالشراكة مع المجتمعات الفلسطينية لدعم حقوقهم في الصحة والكرامة. "
    "نقوم بذلك من خلال تطوير خدمات رعاية صحية فعالة ومستدامة وبقيادة محلية، "
    "وتوفير المساعدة الطبية أثناء حالات الطوارئ، ",
    "والقيام بحملات لكسر الحواجز التي تعترض الصحة والرعاية الصحية الفلسطينية اليوم وفي المستقبل."
    "full_description": "تتطلع جمعية العون الطبي للفلسطينيين (ماب) إلى مستقبل يتمتع فيه كافة الفلسطينيين بالقدرة على الوصول إلى نظام رعاية صحية فعّال ومستدام تقوم عليه كوادر محلية، "
    "وإلى مستقبل يتمتع فيه الفلسطينيون بكامل حقوقهم في الصحة والكرامة.\n\n"
    "تعمل ماب في برامجها في الضفة الغربية والقدس الشرقية وقطاع غزة ولبنان مع شركاء محليين ذوي خبرة وثقة لتحقيق رؤيتها، "
    "حيث يقوم الفلسطينيون بتصميم وتنفيذ هذه البرامج لتعزيز الوصول لخدمات الصحة الأساسية وبناء الخبرات المحلية للتعامل مع تحديات الرعاية الصحية، "
    "وتتمتع ماب بالجاهزية لتقديم دعمها السريع في حالات الطوارئ الإنسانية عبر توفير العون والمساعدة.\n\n"
    "تلتزم ماب بمسؤولية شهادتها على أوجه الظلم الناتجة عن الاحتلال الإسرائيلي والتهجير والصراع، "
    "وتشارك شهادتها في المملكة المتحدة وحول العالم، كما وتكفل وصول صوت الفلسطينيين إلى أعلى المستويات "
    "من أجل المطالبة بحلول للعقبات السياسية والاجتماعية التي تحول دون وصول الفلسطينيين لحقوقهم في الصحة والكرامة.",   "website": "https://www.map.org.uk/",
    "social_media": "Medical Aid for Palestinians"
}
    ],
     "مؤسسات دعم الارامل": [
      
      {
    "name": "مؤسسة الأمل الدولية الخيرية",
    "short_description":  "تتطلع جمعية العون الطبي للفلسطينيين (ماب) إلى مستقبل يتمتع فيه كافة الفلسطينيين بالقدرة على الوصول إلى نظام رعاية صحية فعّال ومستدام تقوم عليه كوادر محلية، "
    "وإلى مستقبل يتمتع فيه الفلسطينيون بكامل حقوقهم في الصحة والكرامة.\n\n"
    "تعمل ماب في برامجها في الضفة الغربية والقدس الشرقية وقطاع غزة ولبنان مع شركاء محليين ذوي خبرة وثقة لتحقيق رؤيتها، "
    "حيث يقوم الفلسطينيون بتصميم وتنفيذ هذه البرامج لتعزيز الوصول لخدمات الصحة الأساسية وبناء الخبرات المحلية للتعامل مع تحديات الرعاية الصحية، "
    "وتتمتع ماب بالجاهزية لتقديم دعمها السريع في حالات الطوارئ الإنسانية عبر توفير العون والمساعدة.\n\n"
    "تلتزم ماب بمسؤولية شهادتها على أوجه الظلم الناتجة عن الاحتلال الإسرائيلي والتهجير والصراع، "
    "وتشارك شهادتها في المملكة المتحدة وحول العالم، كما وتكفل وصول صوت الفلسطينيين إلى أعلى المستويات "
    "من أجل المطالبة بحلول للعقبات السياسية والاجتماعية التي تحول دون وصول الفلسطينيين لحقوقهم في الصحة والكرامة.",
     "website":     
      "https://www.alamal-international.com/",
    "social_media": "Alamal International Charity",
        "contact": "+96171656318",
        "email": "info@alamal-international.com"
  
},
{
    "name": "دعم الأسر الفلسطينية بنك الطعام المصري",
    "short_description":"يستمر بنك الطعام المصري في تقديم الدعم الغذائي للأسر الفلسطينية الموجودة في محافظات مصر المختلفة، وذلك عن طريق تقديم كراتين غذائية تحتوي على الأرز والبقوليات والمعلبات، بالإضافة إلى مواد غذائية للأطفال وكبار السن، والمساعدات النقدية للأسر المحتاجة.\n\n"
    "ويأتي ذلك ضمن مبادرة متكاملة تتضمن تقديم المساعدات الغذائية المختلفة، هذا الدعم الغذائي يحتوي على (الكرتونة الغذائية، السلع التموينية، الدعم النقدي، الوجبات الساخنة).\n\n"
    ,"full_description":  "الكراتين الغذائية الشهرية: الكرتونة قيمتها 400 جنيه مجهزة بمحتويات غذائية مختلفة ومتنوعة تتناسب مع ثقافتهم الغذائية وأحياناً يتم إرفاق بها العديد من التبرعات العينية المخصصة للأسر الفلسطينية مثل الدقيق والزيت، وغيره.\n"
    "مكونات الكرتونة: أرز 1 كيلو - عدس أصفر 500 جرام - عدس بحبه 500 جرام - كيس سكر - دقيق 2 كيلو - مكرونة كيلو ونص - زجاجة زيت - برطمان عسل أبيض - لبن 2 لتر - 3 علبة فول معلب - 3 علبة كاند بيف.\n"
    "القسائم الشرائية: أكواد شهرية يتم إرسالها لعدد من الأسر الفلسطينية بقيمة شرائية محددة على حسب عدد أفراد الأسرة:\n"
    "- تكفي فرد: فردين (600 ج)\n"
    "- تكفي 3-5 أفراد (900 ج)\n"
    "- تكفي 6 أفراد أو أكثر (1200 ج)\n"
    "يتم صرفها عبر فروع خير زمان المنتشرة في محافظات مصر.\n"
    "الوجبات الساخنة: وجبات يومية (65 ج) تصل للأسر الفلسطينية الأشد احتياجًا للوجبات المطبوخة مثل الأطفال وكبار السن.\n"
    "الاستفسار والتحصيل من المنازل: 16060.",
    "website": "دعم الأسر الفلسطينية في مصر - بنك الطعام المصري",
    "social_media": "Egyptian Food Bank | Cairo"
}
],
    "مؤسسات الاغاثة الطارئة ": [
        {
            "name": "هيئة الإغاثة الإنسانية IHH",
            "short_description": "هيئة الإغاثة الإنسانية (IHH) هي منظمة غير حكومية تنشط في 123 دولة، وتقدم المساعدات الإنسانية في مناطق الحروب والكوارث دون تمييز. تشمل أنشطتها تقديم المساعدات الغذائية، والرعاية الصحية، بالإضافة إلى بناء دور رعاية الأيتام والمدارس والمستشفيات.",
                "website": "هيئة الإغاثة الإنسانية IHH",
                "social_media": "هيئة الإغاثة الإنسانية وحقوق الإنسان والحريات",
                "location": "Istanbul",
                "phone": "+90 212 631 21 21"
        },
        {
            "name": "مؤسسة الإغاثة والطوارئ",
            "short_description": "مؤسسة تنموية أهلية وطنية غير حكومية وغير هادفة للربح تعمل على تمكين الأفراد والمجتمعات صحيًا ومعرفيًا لتحسين جودة الحياة. "
    "تعتبر الإنسان وسعادته هدفًا للتنمية المستدامة، وهي مؤسسة مركزية مشهرة برقم 638 لسنة 2013 ونطاق عملها جمهورية مصر العربية. "
    "تعمل طبقًا لقانون تنظيم ممارسة العمل الأهلي 149 لسنة 2019 ولائحته التنفيذية.\n"
    "تعتمد على أحدث منهجيات العمل المؤسسي التنموي والحرفية، وتعمل على عدد من القضايا التنموية، منها:\n"
    "- مكافحة الفقر والحد من الجوع وأمراض سوء التغذية.\n"
    "- الرعاية الصحية الأساسية.\n"
    "- تحسين الرعاية البديلة.\n"
    "- تحسين الاستجابة للأزمات والكوارث.",
       "contact_info": {
                "website": "https://reliefeg.org",
                "phone": "+2-01068850770"
            }
        }
    ]


    },
    // "مصر": {
    //   "الأيتام": [
    //     {
    //       "name": "جمعية الأيتام المصرية",
    //       "short_description": "جمعية خيرية تهدف لتقديم الدعم للأيتام في مصر.",
    //       "full_description": "تهدف الجمعية إلى تقديم الرعاية والدعم النفسي والتعليم للأيتام في مختلف المحافظات المصرية.",
    //       "contact": "+20 2 123456789",
    //       "website": "https://www.egyptorphans.org",
    //       "social_media": "https://www.facebook.com/EgyptOrphans"
    //     }
    //   ],
    //   "الإغاثة الطارئة": [
    //     {
    //       "name": "جمعية الإغاثة المصرية",
    //       "short_description": "تقديم الدعم والإغاثة للمحتاجين والمتضررين من الأزمات الطبيعية في مصر.",
    //       "full_description": "نساعد في توفير الغذاء والمياه والخدمات الصحية في المناطق المتضررة من الأزمات.",
    //       "contact": "+20 2 987654321",
    //       "website": "https://www.egyptrelief.org",
    //       "social_media": "https://www.facebook.com/EgyptRelief"
    //     }
    //   ]
    // },
    // "الأردن": {
    //   "دعم الأرامل": [
    //     {
    //       "name": "مؤسسة الأمل الأردنية",
    //       "short_description": "جمعية خيرية تهدف لدعم الأرامل وتوفير المساعدات المالية لهم.",
    //       "full_description": "نعمل على تحسين حياة الأرامل من خلال المساعدات المالية والبرامج الاجتماعية.",
    //       "contact": "+962 6 2345678",
    //       "website": "https://www.jordanhope.org",
    //       "social_media": "https://www.facebook.com/JordanHope"
    //     }
    //   ]
    // }
  };

  // 🔹 إدخال البيانات إلى Firestore لكل دولة
  for (var country in countriesData.keys) {
    for (var category in countriesData[country]!.keys) {
      for (var charity in countriesData[country]![category]!) {
        await firestore
            .collection("charities") // Main collection for charities
            .doc(country) // Document for each country (e.g., "فلسطين", "مصر", "الأردن")
            .collection(category) // Categories inside the country
            .doc(charity["name"]) // Document for each charity
            .set(charity); // Set the charity data
      }
    }
  }

  print("✅ تم إدخال جميع البيانات إلى Firebase Firestore بنجاح!");
}
