import 'package:flutter/material.dart';
import 'package:google_fonts/google_fonts.dart';

class PolicyViewBody extends StatelessWidget {
  const PolicyViewBody({super.key});

  @override
  Widget build(BuildContext context) {
    return 
       SingleChildScrollView(
        
        padding: EdgeInsets.only(right: 16,left: 16,top: 24),
        child: Text(
                '''مرحبًا بك في تطبيق "عطاء"!
بما أن التطبيق يهدف إلى تسهيل التبرع ودعم الجمعيات الخيرية، فإن استخدامك للتطبيق يخضع للشروط والأحكام التالية. يرجى قراءتها بعناية لضمان تجربة آمنة وسلسة.

1. مقدمة
تطبيق "عطاء" هو منصة تهدف إلى ربط المستخدمين بالجمعيات الخيرية الموثوقة في مصر والعالم العربي، لتسهيل عملية التبرع وزيادة الوعي بأهمية المساهمة الخيرية. باستخدام التطبيق، فإنك توافق على الالتزام بجميع الشروط الواردة هنا.

2. استخدام التطبيق
1 الغرض الأساسي:
يستخدم التطبيق فقط لتسهيل عملية التبرع للجمعيات الخيرية الموثوقة، والاطلاع على المعلومات المرتبطة بالقضايا الخيرية.
2 التصفح دون تسجيل
لا يتطلب التطبيق تسجيل دخول أو إدخال أي بيانات شخصية من المستخدمين، حيث يمكن الوصول إلى كافة الخدمات بشكل مباشر.
3 الاستخدام غير المصرح به
يحظر استخدام التطبيق لأي غرض غير قانوني أو غير أخلاقي.

3 التبرعات
1 توفير المعلومات
جميع المعلومات المتعلقة بالجمعيات الخيرية المعروضة على التطبيق يتم توفيرها من قبل الجهات المسؤولة عنها. التطبيق لا يتحمل أي مسؤولية عن دقة هذه المعلومات.
2 معالجة التبرعات:
تتم معالجة التبرعات من خلال بوابات دفع إلكترونية آمنة. التطبيق لا يحتفظ بأي بيانات مالية أو مصرفية للمستخدمين.
3 عدم استرداد التبرعات:
جميع التبرعات غير قابلة للاسترداد بمجرد إتمامها، إلا في حال وجود خطأ تقني موثق.

4. الحقوق والمسؤوليات
1 مسؤولية الجمعيات
التطبيق يربط المستخدمين فقط بالجمعيات الخيرية ولا يتحمل أي مسؤولية عن كيفية استخدام الأموال المتبرع بها.
2 الشفافية:
الجمعيات المضافة في التطبيق مسؤولة عن تقديم تقارير شفافة عن استخدام التبرعات.

5. حماية البيانات
1 الخصوصية:
التطبيق لا يجمع أو يحتفظ بأي بيانات شخصية للمستخدمين، مما يضمن الخصوصية الكاملة لهم أثناء استخدامهم للتطبيق.
2 التشفير:
تستخدم تقنيات التشفير لضمان أمان العمليات المالية أثناء التبرعات.

6. تحديثات التطبيق
1. يحق لإدارة التطبيق تعديل أو تحسين الخدمات المقدمة في أي وقت بما يتماشى مع رؤيتنا وأهدافنا.
2. سيتم إعلام المستخدمين بأي تغييرات كبيرة في الشروط والأحكام من خلال إشعار داخل التطبيق.

7 حقوق الملكية الفكرية
1 جميع المحتوى المتوفر داخل التطبيق، بما في ذلك النصوص الصور والشعارات، محمي بحقوق الملكية الفكرية الخاصة بالتطبيق.
2 يحظر استخدام أي محتوى دون إذن كتابي مسبق.

8. حدود المسؤولية
1 لا يتحمل التطبيق أي مسؤولية عن أي خسائر مباشرة أو غير مباشرة ناتجة عن استخدامه أو عدم القدرة على استخدامه.
2. يتم تقديم الخدمة كما هي دون أي ضمانات إضافية.

9. إنهاء الخدمة
يحتفظ التطبيق بالحق في تعليق أو إنهاء استخدام أي شخص ينتهك الشروط والأحكام أو يستخدم التطبيق بطريقة غير قانونية.

10. التواصل
لأي استفسارات أو شكاوى، يُرجى التواصل معنا عبر قسم "اتصل بنا" داخل التطبيق.

قبول الشروط
باستخدام تطبيق "عطاء"، فإنك توافق على جميع الشروط والأحكام المذكورة أعلاه. نحن نهدف إلى تقديم تجربة آمنة ومريحة للجميع، وتسعد بمساعدتك في أي وقت.

شكراً لاختيارك تطبيق "عطاء"!
''', textAlign: TextAlign.right,

          style:  GoogleFonts.tajawal(fontSize: 16.0,),
        ),
      
    );
  }
}