import 'package:flutter/material.dart';

class PolicyViewBody extends StatelessWidget {
  const PolicyViewBody({super.key});

  @override
  Widget build(BuildContext context) {
    return 
       SingleChildScrollView(
        padding: EdgeInsets.all(16.0),
        child: Text(
          r"""سياسة الخصوصية لتطبيق عطاء

تطبيق عطاء يلتزم بحماية خصوصية مستخدميه وضمان استخدام بياناتهم بطريقة آمنة ومسؤولة. نرجو قراءة سياسة الخصوصية بعناية لفهم كيف نجمع، نستخدم، ونحمي معلوماتك الشخصية.

1. جمع المعلومات

يقوم التطبيق بجمع المعلومات التي تقدمها طواعية، مثل الاسم، البريد الإلكتروني، ورقم الهاتف عند التسجيل أو استخدام ميزات معينة.
قد يتم جمع بيانات أخرى تلقائيًا مثل نوع الجهاز، نظام التشغيل، وعنوان بروتوكول الإنترنت (IP).

2. استخدام المعلومات

نستخدم المعلومات لتحسين خدماتنا وضمان تجربة مستخدم مميزة.
قد نستخدم بياناتك للرد على استفساراتك أو لتقديم إشعارات مرتبطة بالتطبيق.
قد يتم استخدام البيانات المجمعة لأغراض التحليل والإحصائيات لتحسين الأداء والخدمات.

3. مشاركة المعلومات

لن يتم بيع أو مشاركة معلوماتك الشخصية مع أطراف ثالثة إلا في الحالات الضرورية، مثل:
- الامتثال للقوانين واللوائح.
- حماية حقوق وأمان المستخدمين أو التطبيق.

4. تخزين المعلومات

يتم تخزين بياناتك بشكل آمن ولا يمكن الوصول إليها إلا من قبل موظفين مخولين.
نحتفظ ببياناتك فقط للمدة اللازمة لتحقيق الأغراض المذكورة في هذه السياسة.

5. حقوق المستخدمين

لديك الحق في الوصول إلى بياناتك الشخصية، تحديثها، أو طلب حذفها.
يمكنك التحكم في إعدادات الخصوصية الخاصة بك من خلال التطبيق.

6. أمان البيانات

نتخذ التدابير الأمنية المناسبة لحماية بياناتك من الوصول غير المصرح به أو التعديل أو الكشف.

7. التعديلات على سياسة الخصوصية

قد نقوم بتحديث سياسة الخصوصية من وقت لآخر. سيتم إخطارك بالتغييرات من خلال التطبيق أو البريد الإلكتروني.""",
          textAlign: TextAlign.right,
          style: TextStyle(fontSize: 16.0),
        ),
      
    );
  }
}